ext_b24/DataProcessors/алсавб24_ВыгрузкаПартнеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>алсавб24_ВыгрузкаПартнеров</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

ext_b24/InformationRegisters/алсавб24_СопоставлениеКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>алсавб24_СопоставлениеКлиентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>TITLE</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПохожийПартнер1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПохожийПартнер2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПохожийПартнер3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ext_b24/DataProcessors/алсавб24_ВыгрузкаПартнеров/Ext/ManagerModule.bsl
//// Выгрузка данных партнёра из 1С в Б24
// Сначала проверить, есть ли сопоставление в регистре алсавб24_СопоставлениеКлиентов
// если есть то выполняем crm_company_update если нету то выполняем crm_company_add 
// если выполняем crm_company_add тогда необходимо зарегестрировать новое соотвествие в алсавб24_СопоставлениеКлиентов

///
// Проверить наличие сопоставления партнера в регистре
// Параметры:
//  Партнер - СправочникСсылка.Партнеры - ссылка на партнера
// Возвращаемое значение:
//  Число - ID компании в Б24 или 0 если не найдено
//
Функция ПроверитьСопоставлениеПартнера(Партнер) Экспорт
	
	// Сначала ищем по ORIGIN_ID (уникальный идентификатор 1С)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	алсавб24_СопоставлениеКлиентов.ID КАК ID
		|ИЗ
		|	РегистрСведений.алсавб24_СопоставлениеКлиентов КАК алсавб24_СопоставлениеКлиентов
		|ГДЕ
		|	алсавб24_СопоставлениеКлиентов.Партнер = &Партнер";
	
	Запрос.УстановитьПараметр("Партнер", Партнер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ID;
	
КонецФункции

///
// Найти компанию в Б24 по ORIGIN_ID
// Параметры:
//  ORIGIN_ID - Строка - уникальный идентификатор партнера из 1С
// Возвращаемое значение:
//  Число - ID компании в Б24 или 0 если не найдено
//
Функция НайтиКомпаниюПоОriginID(ORIGIN_ID) Экспорт
	
	Фильтр = Новый Структура;
	Фильтр.Вставить("ORIGIN_ID", ORIGIN_ID);
	
	APIРезультат = алсавб24_api_CRM_Компании.crm_company_list(Фильтр);
	
	Если APIРезультат.Свойство("result") И APIРезультат.result.Количество() > 0 Тогда
		Возврат APIРезультат.result[0].ID;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

///
// Подготовить поля партнера для выгрузки в Б24
// Параметры:
//  Партнер - СправочникСсылка.Партнеры - ссылка на партнера
// Возвращаемое значение:
//  Структура - поля для API Б24
//
Функция ПодготовитьПоляПартнера(Партнер) Экспорт
	
	Поля = Новый Структура;
	
	// Основные поля
	Поля.Вставить("TITLE", Партнер.Наименование);
	
	// Поля для идентификации источника
	Поля.Вставить("ORIGIN_ID", Строка(Партнер.УникальныйИдентификатор()));
	Поля.Вставить("ORIGINATOR_ID", "1С8 УТ11");
	Поля.Вставить("ORIGIN_VERSION", Строка(Партнер));
	
	// Комментарий
	Если ЗначениеЗаполнено(Партнер.Комментарий) Тогда
		Поля.Вставить("COMMENTS", Партнер.Комментарий);
	КонецЕсли;
	
	// Контактная информация - для мультиполей используем массив структур
	Телефоны = Новый Массив;
	Emails = Новый Массив;
	Сайты = Новый Массив;
	
	КонтактнаяИнформация = Партнер.КонтактнаяИнформация;
	Для Каждого СтрокаКИ Из КонтактнаяИнформация Цикл
		Если СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			Телефон = Новый Структура;
			Телефон.Вставить("VALUE", СтрокаКИ.Представление);
			Телефон.Вставить("VALUE_TYPE", "WORK");
			Телефоны.Добавить(Телефон);
		ИначеЕсли СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Email Тогда
			Email = Новый Структура;
			Email.Вставить("VALUE", СтрокаКИ.Представление);
			Email.Вставить("VALUE_TYPE", "WORK");
			Emails.Добавить(Email);
		ИначеЕсли СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.ВебСайт Тогда
			Сайт = Новый Структура;
			Сайт.Вставить("VALUE", СтрокаКИ.Представление);
			Сайт.Вставить("VALUE_TYPE", "WORK");
			Сайты.Добавить(Сайт);
		КонецЕсли;
	КонецЦикла;
	
	Если Телефоны.Количество() > 0 Тогда
		Поля.Вставить("PHONE", Телефоны);
	КонецЕсли;
	
	Если Emails.Количество() > 0 Тогда
		Поля.Вставить("EMAIL", Emails);
	КонецЕсли;
	
	Если Сайты.Количество() > 0 Тогда
		Поля.Вставить("WEB", Сайты);
	КонецЕсли;
	
	// Адрес - используем кастомное поле из Б24
	Адрес = "";
	Для Каждого СтрокаКИ Из КонтактнаяИнформация Цикл
		Если СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.ЮридическийАдрес
			Или СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.ФактическийАдрес Тогда
			Адрес = СтрокаКИ.Представление;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Адрес) Тогда
		Поля.Вставить("UF_CRM_COMPANY_AMO_QKIRPNDLIBWGF", Адрес);
	КонецЕсли;
	
	Возврат Поля;
	
КонецФункции

///
// Зарегистрировать новое сопоставление партнера
// Параметры:
//  Партнер - СправочникСсылка.Партнеры - ссылка на партнера
//  IDБ24 - Число - ID компании в Б24
//
Процедура ЗарегистрироватьСопоставление(Партнер, IDБ24) Экспорт
	
	НаборЗаписей = РегистрыСведений.алсавб24_СопоставлениеКлиентов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ID.Установить(IDБ24);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.ID = IDБ24;
	НоваяЗапись.Партнер = Партнер;
	НоваяЗапись.TITLE = Партнер.Наименование;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

///
// Основная функция выгрузки партнера в Б24
// Параметры:
//  ссылкаНаПартнера - СправочникСсылка.Партнеры - ссылка на партнера для выгрузки
// Возвращаемое значение:
//  Структура - результат операции с ID и статусом
//
Функция ВыгрузитьВБ24(ссылкаНаПартнера) ЭКСПОРТ
	
	Результат = Новый Структура;
	Результат.Вставить("Успех", Ложь);
	Результат.Вставить("ID", 0);
	Результат.Вставить("Сообщение", "");
	
	Попытка
		// Шаг 1: Проверяем наличие сопоставления в регистре
		IDБ24ИзРегистра = ПроверитьСопоставлениеПартнера(ссылкаНаПартнера);
		
		// Шаг 2: Ищем компанию в Б24 по ORIGIN_ID
		ORIGIN_ID = Строка(ссылкаНаПартнера.УникальныйИдентификатор());
		IDБ24ИзAPI = НайтиКомпаниюПоОriginID(ORIGIN_ID);
		
		// Шаг 3: Подготавливаем поля партнера
		Поля = ПодготовитьПоляПартнера(ссылкаНаПартнера);
		
		// Шаг 4: Определяем ID компании для обновления или создания
		ИтоговыйIDБ24 = 0;
		
		Если IDБ24ИзРегистра > 0 Тогда
			ИтоговыйIDБ24 = IDБ24ИзРегистра;
		ИначеЕсли IDБ24ИзAPI > 0 Тогда
			ИтоговыйIDБ24 = IDБ24ИзAPI;
			// Регистрируем найденное сопоставление
			ЗарегистрироватьСопоставление(ссылкаНаПартнера, IDБ24ИзAPI);
		КонецЕсли;
		
		// Шаг 5: Выполняем действие в зависимости от результата проверки
		Если ИтоговыйIDБ24 > 0 Тогда
			// Обновляем существующую компанию
			APIРезультат = алсавб24_api_CRM_Компании.crm_company_update(ИтоговыйIDБ24, Поля);
			
			Если APIРезультат.Свойство("result") Тогда
				Результат.Успех = Истина;
				Результат.ID = ИтоговыйIDБ24;
				Результат.Сообщение = "Компания успешно обновлена в Б24";
			Иначе
				Результат.Сообщение = "Ошибка при обновлении компании: " + APIРезультат.Описание;
			КонецЕсли;
		Иначе
			// Создаем новую компанию
			APIРезультат = алсавб24_api_CRM_Компании.crm_company_add(Поля);
			
			Если APIРезультат.Свойство("result") Тогда
				НовыйID = APIРезультат.result;
				
				// Регистрируем новое сопоставление
				ЗарегистрироватьСопоставление(ссылкаНаПартнера, НовыйID);
				
				Результат.Успех = Истина;
				Результат.ID = НовыйID;
				Результат.Сообщение = "Компания успешно создана в Б24";
			Иначе
				Результат.Сообщение = "Ошибка при создании компании: " + APIРезультат.Описание;
			КонецЕсли;
		КонецЕсли;
		
	Исключение
		Результат.Сообщение = "Критическая ошибка: " + ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции
